import React,{useState} from 'react'
import style from '../css/message.module.css'
function Message() {
    const [selectedWord, setSelectedWord] = useState(null);
    const List =[
        "( وبشر الصابرين  الذين إذا أصابتهم مصيبة قالوا إنّا لله وإنّا إليه راجعون )",
        "( وما تقدموا لأنفسكم من خيرٍ تجدوه عند الله )",
        "( واستعينوا بالصبر والصلاة وإنها لكبيرة إلا على الخاشعين )",
        "( وتعاونوا على البر والتقوى ولا تعاونوا على الإثم والعدوان )",
        "( واتقوا يومًا لا تجزي نفس عن نفسٍ شيئًا ولا يقبل منها شفاعة ولا يؤخذ منها عدل ولا هم ينصرون )",
        "( والذين آمنوا وعملوا الصالحات أولئك أصحاب الجنة هم فيها خالدون )",
        "( وأقيموا الصلاة وآتوا الزكاة وما تقدموا لأنفسكم من خيرٍ تجدوه عند الله إن الله بما تعملون بصير )",
        "( ومن يتق الله يجعل له مخرجًا ويرزقه من حيث لا يحتسب )",
        "( لا يكلف الله نفسًا إلا وسعها لها ما كسبت وعليها ما اكتسبت )",
        "( ويمكرون ويمكر الله والله خير الماكرين )",
        "( فإن مع العسر يسرًا إن مع العسر يسرًا )",
        "( ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك )",
        "(وَلَقَد مَننَّا عَلَيكَ مرَّةً أُخرَى)",
        "(استعن بالله في كل شئ ولن يخذلك الله ابدا)",
        "(أنه هو اضحك وابكي)",
        "(وإن زادت همومك فأعلم بأن لُطف الله مُمتد، والله لا يُضيع عباده لن يتركك الله في هذه المأساه كثيرًا ثق بالله، ثق بالله وأعلم بأن السعادة ستأتِ لك.)",
        "(ذلك الفرح الذي ادخلته على قلب أحدهم حتى ولو بكلمه ، لن ينساه الله وسيرتد إليك في ضيقك لتفرح)",
        "(ألا بِذكرِ اللهِ تطمئنِّ القلوبُ)",
        "(اطمئن :سعادتك بيد الله لا صديق ينزعها ولا معشوق يمزقها ولا قريب يتحكم بها )",
        "(اتعلم ما معنى جملة [عسى في الأمر خيرة] ؟  تعني انه يبتعد شيء ، ليقترب شيء أجمل)",
        "(فإنكَ بأعيننا . - اللهم شعور هذه الآية .. فهل بعد هذه العناية قلق!!؟)",
        "(لن يتركك الله وسط الحروب دون أن يرسل إليك رسالة واحدة على الأقل يخبرك فيها عن سبب كل هذا ، ويخبرك أيضاً بأنك قادر وتستطيع أن تتجاوز كل ذلك !! فاهدأ واطمئن واصبر فثمَّ الفلاح والنجاة . يا أيها الذين آمنوا اصبروا وصابروا ورابطوا واتقوا الله لعلكم تفلحون  )",
        "(تمسك بالدُّعاء كأنك لا تعرف علاجاً غيره)",
        "(كيف حال قلبك ؟  - يسأل الله الثبّات و القوة بكُل ليلة)",
        "(إلى كل من أُغلقت بوجهه الأبواب وحاصره القلق والشؤم لا تيأس ستُفرج قريبًا والدروب المغلقة فتحها من الله قريب. قال تعالى : فعسى الله ان يأتي بالفتح أو أمر من عنده)",
        "(كل ندبة في قلبك سيداويها الله ، كل حزن في روحك سيجبره الله ، كل هم في حياتك سيفرجه الله ، كل خيبة أمل حطمت نفسك سيعوضك الله عنها ، لا تقنط من رحمة ربك مهما زادت عليك الضغوط ، بعون الله ستتخطى همومك، ستتجاوز أحزانك، ستحقق أحلامك.. أنت تتعامل مع رب قدير ورحيم )",
        "(مع الوقت ستعرف حكمة الله في كل ما حدث لك . ستعرف انه كان ارحم بك من نفسك)",
        "(ولسوف يعطيك ربك فترضى  حتى في ايامك الصعبة ! فهو يشتاق لدعاءك فيبتليك ، يريد تكفير خطاياك وتطهيرك ، يريد أن يعوضك باضعاف اضعاف صبرك ، يريد ان يبهرك بعطاء تنسى بعده كل أسى وبؤ)",
        "(فما ضاقت إلا ليفرجها الله عليك)",
        "(ولا تدري كم صرف الله عنك من الأذى وأنت ببصيرتك المحدودة تبكي عليه)"


    ]
    const selectRandomWord = () => {
        const randomIndex = Math.floor(Math.random() * List.length);
        const randomWord = List[randomIndex];
        setSelectedWord(randomWord);
      };
  return (
    <div className={style.message}>
        <div className={style.text}><p>{selectedWord}</p></div>
        
<button role="button" class={style.button_name} onClick={selectRandomWord}>اضغط</button>
    </div>
  )
}

export default Message;
